# loc and iloc

* loc: select by labels of rows and columns

* iloc: select by positions of rows and columns

<img src="Assets/loc_iloc.png" class="juno_ui_theme_light" style="width:600px">

We will use a credit card customers [dataset](https://www.kaggle.com/datasets/sakshigoyal7/credit-card-customers?resource=download) available on Kaggle with a creative commons license.

In [1]:
import pandas as pd

churn = pd.read_csv(
    "Data/BankChurners.csv",
    usecols=["Attrition_Flag", "Marital_Status", "Card_Category", "Customer_Age", "Total_Trans_Amt"]
)

churn.head()

,Attrition_Flag,Customer_Age,Marital_Status,Card_Category,Total_Trans_Amt
0,Existing Customer,45,Married,Blue,1144
1,Existing Customer,49,Single,Blue,1291
2,Existing Customer,51,Married,Blue,1887
3,Existing Customer,40,Unknown,Blue,1171
4,Existing Customer,40,Married,Blue,816

In [2]:
churn = churn.rename(
    columns={
        "Attrition_Flag": "churn",
        "Customer_Age": "age",
        "Marital_Status": "marital_status",
        "Card_Category": "card_category",
        "Total_Trans_Amt": "total_trans_amt"
    }
)

churn.head()

               churn  age marital_status card_category  total_trans_amt
0  Existing Customer   45        Married          Blue             1144
1  Existing Customer   49         Single          Blue             1291
2  Existing Customer   51        Married          Blue             1887
3  Existing Customer   40        Unknown          Blue             1171
4  Existing Customer   40        Married          Blue              816

## Exercise 1

In [3]:
churn.loc[0, "marital_status"]

'Married'

In [4]:
churn.loc[4, "total_trans_amt"]

816

## Exercise 2

In [5]:
churn.iloc[0, 2]

'Married'

In [6]:
churn.iloc[4, 4]

816

* Rows are assigned integer index (0, 1, 2, ...) by default. 
* Unless we customize/change them, row indices and labels are the same.
* Column index starts from 0 as well.
* Column labels are column names.

## Exercise 3

In [7]:
churn.iloc[4,]

churn              Existing Customer
age                               40
marital_status               Married
card_category                   Blue
total_trans_amt                  816
Name: 4, dtype: object

## Exercise 4

In [8]:
churn.loc[:5, "marital_status"]

0    Married
1     Single
2    Married
3    Unknown
4    Married
5    Married
Name: marital_status, dtype: object

In [9]:
churn.loc[0:5, "marital_status"]

0    Married
1     Single
2    Married
3    Unknown
4    Married
5    Married
Name: marital_status, dtype: object

In [10]:
churn.loc[4:8, "marital_status"]

4    Married
5    Married
6    Married
7    Unknown
8     Single
Name: marital_status, dtype: object

## Exercise 5

In [11]:
churn.head()

               churn  age marital_status card_category  total_trans_amt
0  Existing Customer   45        Married          Blue             1144
1  Existing Customer   49         Single          Blue             1291
2  Existing Customer   51        Married          Blue             1887
3  Existing Customer   40        Unknown          Blue             1171
4  Existing Customer   40        Married          Blue              816

In [12]:
churn.loc[4:8, "marital_status"]

4    Married
5    Married
6    Married
7    Unknown
8     Single
Name: marital_status, dtype: object

In [13]:
churn.iloc[4:8, 2]

4    Married
5    Married
6    Married
7    Unknown
Name: marital_status, dtype: object

* Upper bound is exclusive with iloc.

## Exercise 6

In [14]:
churn.iloc[4:8,]

               churn  age marital_status card_category  total_trans_amt
4  Existing Customer   40        Married          Blue              816
5  Existing Customer   44        Married          Blue             1088
6  Existing Customer   51        Married          Gold             1330
7  Existing Customer   32        Unknown        Silver             1538

## Exercise 7

In [15]:
churn.iloc[:5, :3]

               churn  age marital_status
0  Existing Customer   45        Married
1  Existing Customer   49         Single
2  Existing Customer   51        Married
3  Existing Customer   40        Unknown
4  Existing Customer   40        Married

In [16]:
churn.iloc[10:15, 2:]

   marital_status card_category  total_trans_amt
10        Unknown          Blue             1201
11        Married          Blue             1314
12         Single          Blue             1539
13        Unknown          Blue             1311
14        Married          Blue             1570

## Exercise 8

In [17]:
churn.loc[10:15, ["marital_status", "card_category", "total_trans_amt"]]

   marital_status card_category  total_trans_amt
10        Unknown          Blue             1201
11        Married          Blue             1314
12         Single          Blue             1539
13        Unknown          Blue             1311
14        Married          Blue             1570
15        Unknown          Blue             1348

In [18]:
churn.iloc[10:16, [2, 3, 4]]

   marital_status card_category  total_trans_amt
10        Unknown          Blue             1201
11        Married          Blue             1314
12         Single          Blue             1539
13        Unknown          Blue             1311
14        Married          Blue             1570
15        Unknown          Blue             1348

## Exercise 9

In [19]:
churn.iloc[-5:,]

                   churn  age marital_status card_category  total_trans_amt
10122  Existing Customer   50         Single          Blue            15476
10123  Attrited Customer   41       Divorced          Blue             8764
10124  Attrited Customer   44        Married          Blue            10291
10125  Attrited Customer   30        Unknown          Blue             8395
10126  Attrited Customer   43        Married        Silver            10294

In [20]:
churn.tail()

                   churn  age marital_status card_category  total_trans_amt
10122  Existing Customer   50         Single          Blue            15476
10123  Attrited Customer   41       Divorced          Blue             8764
10124  Attrited Customer   44        Married          Blue            10291
10125  Attrited Customer   30        Unknown          Blue             8395
10126  Attrited Customer   43        Married        Silver            10294

## Exercise 10

In [21]:
churn.iloc[-5:, -2:]

      card_category  total_trans_amt
10122          Blue            15476
10123          Blue             8764
10124          Blue            10291
10125          Blue             8395
10126        Silver            10294

* We cannot use negative values with loc since "negative label" does not make sense.

## Exercise 11

In [22]:
churn.iloc[-5:, :3]

                   churn  age marital_status
10122  Existing Customer   50         Single
10123  Attrited Customer   41       Divorced
10124  Attrited Customer   44        Married
10125  Attrited Customer   30        Unknown
10126  Attrited Customer   43        Married

## Exercise 12

In [23]:
churn.iloc[-10:-5, 3:]

      card_category  total_trans_amt
10117          Blue            17498
10118          Blue            10310
10119          Blue             6009
10120          Blue            15577
10121          Blue            14596

## Exercise 13

In [24]:
churn.head()

               churn  age marital_status card_category  total_trans_amt
0  Existing Customer   45        Married          Blue             1144
1  Existing Customer   49         Single          Blue             1291
2  Existing Customer   51        Married          Blue             1887
3  Existing Customer   40        Unknown          Blue             1171
4  Existing Customer   40        Married          Blue              816

In [25]:
churn[churn["churn"]=="Attrited Customer"].iloc[:5]

                churn  age marital_status card_category  total_trans_amt
21  Attrited Customer   62        Married          Blue              692
39  Attrited Customer   66        Married          Blue              704
51  Attrited Customer   54        Married          Blue              705
54  Attrited Customer   56        Married          Blue              602
61  Attrited Customer   48        Married        Silver              691

## Exercise 14

In [26]:
churn[(churn["churn"]=="Attrited Customer") & (churn["card_category"]=="Silver")].iloc[:5]

                  churn  age marital_status card_category  total_trans_amt
61    Attrited Customer   48        Married        Silver              691
1311  Attrited Customer   40         Single        Silver             1028
1649  Attrited Customer   52        Married        Silver              797
1707  Attrited Customer   40         Single        Silver             1112
1818  Attrited Customer   48        Married        Silver              911

## Exercise 15

In [27]:
churn.iloc[:10:2,]

               churn  age marital_status card_category  total_trans_amt
0  Existing Customer   45        Married          Blue             1144
2  Existing Customer   51        Married          Blue             1887
4  Existing Customer   40        Married          Blue              816
6  Existing Customer   51        Married          Gold             1330
8  Existing Customer   37         Single          Blue             1350

In [28]:
churn.iloc[0:10:2,]

               churn  age marital_status card_category  total_trans_amt
0  Existing Customer   45        Married          Blue             1144
2  Existing Customer   51        Married          Blue             1887
4  Existing Customer   40        Married          Blue              816
6  Existing Customer   51        Married          Gold             1330
8  Existing Customer   37         Single          Blue             1350

## Exercise 16

In [29]:
churn.iloc[0:15:3, :3]

                churn  age marital_status
0   Existing Customer   45        Married
3   Existing Customer   40        Unknown
6   Existing Customer   51        Married
9   Existing Customer   48         Single
12  Existing Customer   56         Single

## Exercise 17

In [30]:
churn.iloc[-10::2,]

                   churn  age marital_status card_category  total_trans_amt
10117  Existing Customer   57        Married          Blue            17498
10119  Attrited Customer   55         Single          Blue             6009
10121  Existing Customer   56         Single          Blue            14596
10123  Attrited Customer   41       Divorced          Blue             8764
10125  Attrited Customer   30        Unknown          Blue             8395

## Exercise 18

In [31]:
churn.iloc[-15:-5:2,]

                   churn  age marital_status card_category  total_trans_amt
10112  Attrited Customer   33        Married          Gold             9338
10114  Existing Customer   29        Married          Blue            14723
10116  Existing Customer   46         Single          Blue            15354
10118  Attrited Customer   50        Unknown          Blue            10310
10120  Existing Customer   54         Single          Blue            15577

## Exercise 19

In [32]:
churn.head()

               churn  age marital_status card_category  total_trans_amt
0  Existing Customer   45        Married          Blue             1144
1  Existing Customer   49         Single          Blue             1291
2  Existing Customer   51        Married          Blue             1887
3  Existing Customer   40        Unknown          Blue             1171
4  Existing Customer   40        Married          Blue              816

In [33]:
churn.loc[:5, "card_category"] = "Blue Plus"

In [34]:
churn.head()

               churn  age marital_status card_category  total_trans_amt
0  Existing Customer   45        Married     Blue Plus             1144
1  Existing Customer   49         Single     Blue Plus             1291
2  Existing Customer   51        Married     Blue Plus             1887
3  Existing Customer   40        Unknown     Blue Plus             1171
4  Existing Customer   40        Married     Blue Plus              816

## Exercise 20

In [35]:
churn.loc[(churn["age"] > 50) & (churn["card_category"] == "Blue"), "over_50_blue"] = 1

churn.head()

,churn,age,marital_status,card_category,total_trans_amt,over_50_blue
0,Existing Customer,45,Married,Blue Plus,1144,NaN
1,Existing Customer,49,Single,Blue Plus,1291,NaN
2,Existing Customer,51,Married,Blue Plus,1887,NaN
3,Existing Customer,40,Unknown,Blue Plus,1171,NaN
4,Existing Customer,40,Married,Blue Plus,816,NaN

In [36]:
churn["over_50_blue"] = churn["over_50_blue"].fillna(0)

In [37]:
churn.loc[(churn["age"] > 50) & (churn["card_category"] == "Blue")].head()

,churn,age,marital_status,card_category,total_trans_amt,over_50_blue
11,Existing Customer,65,Married,Blue,1314,1.0
12,Existing Customer,56,Single,Blue,1539,1.0
14,Existing Customer,57,Married,Blue,1570,1.0
18,Existing Customer,61,Married,Blue,1336,1.0
21,Attrited Customer,62,Married,Blue,692,1.0